Repository: Zacro-Technologies/NeuroForge
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ja

source: Your prediction
ja: あなたの予想

source: Your prediction draft (%)
ja: 入力中の予測（%）

source: Your prediction stays saved while you revise your final answer.
ja: 最終回答を修正しても、最初の予測は保存されます。

source: Your previous setting is unchanged. Try again after freeing local storage.
ja: 以前の設定は変更されていません。端末の空き容量を確保してから、もう一度お試しください。

source: Your profile could not be saved. Your prior profile remains intact; retry to finish onboarding.
ja: プロフィールを保存できませんでした。以前のプロフィールはそのまま残ります。オンボーディングの完了を再試行してください。

source: Your progress
ja: あなたの進捗

source: Your readiness is applied to today’s plan.
ja: あなたの準備が今日の計画に反映されます。

source: Your reason
ja: 選択した理由

source: Your reason changes today’s activity choice. It does not change your measured skill or assign a reviewed challenge band.
ja: 理由に応じて今日の活動を選び直します。測定済みのスキルやレビュー済みの難易度帯を変更する操作ではありません。

source: Your recall remains on screen so you can retry.
ja: リコールは画面上に残るので、再試行できます。

source: Your recall remains on screen. NeuroForge could not save it locally yet.
ja: リコールは画面上に残ります。 NeuroForge はまだローカルに保存できませんでした。

source: Your recalled answer
ja: 思い出したあなたの答え

source: Your recent results improved across two comparable practice periods.
ja: 比較可能な2つの練習期間を通じて、最近の結果が向上しました。

source: Your reminder choices stay editable, but NeuroForge cannot deliver any reminder until notification access is allowed in System Settings.
ja: リマインダーの選択は編集できますが、システム設定で通知アクセスが許可されるまでNeuroForgeはリマインダーを配信できません。

source: Your response
ja: あなたの回答

source: Your restore request is saved. Quit and reopen NeuroForge to verify the reviewed data and apply the backup before study tools start.
ja: 復元リクエストを保存しました。NeuroForge を終了して開き直すと、学習機能を開始する前に確認済みのデータを検証してバックアップを適用します。

source: Your restored data is saved. The completion acknowledgement could not be saved. Try Continue again.
ja: 復元したデータは保存されています。完了の確認を保存できませんでした。「続ける」をもう一度押してください。

source: Your result is saved in Progress.
ja: 結果を「進捗」に保存しました。

source: Your results appear after this block. Practice this skill with a fresh question.
ja: 結果はこのセクションの終了後に表示されます。新しい問題でこのスキルを練習しましょう。

source: Your results only
ja: あなたの結果のみ

source: Your review is saved without changing standardized progress.
ja: 復習内容は、標準化された進捗を変更せずに保存されます。

source: Your reviewed practice supports choosing timed fluency for this family and band. Timing remains optional.
ja: 審査済みの練習記録に基づき、この問題系列と難度帯で時間制の習熟練習を選べます。時間の計測は任意です。

source: Your rhythm
ja: あなたのリズム

source: Your routine
ja: 学習ルーティン

source: Your routine keeps broad STEM coverage over time. Choose contexts and emphasis areas to make it yours.
ja: 日々のルーティンでSTEMを幅広く継続して鍛えます。文脈と重点領域を選び、自分に合う形にしましょう。

source: Your saved answer
ja: 保存した回答

source: Your saved answers are intact. Change or clear the history filters.
ja: 保存済みの回答は失われていません。履歴フィルタを変更またはクリアしてください。

source: Your saved chapter list stays fixed. This choice changes the pacing available for new daily sessions.
ja: 保存済みのセクション一覧は変わりません。この選択は、新しく始めるデイリーセッションで選べるペースに反映されます。

source: Your saved data changed. Review the updated counts and choose a conflict policy again.
ja: 保存データが変わりました。最新の件数を確認し、競合時の処理をもう一度選んでください。

source: Your saved history is still available. Change or clear the active filters to include it.
ja: 保存済み履歴は引き続き利用できます。表示するにはフィルターを変更または解除してください。

source: Your saved private reminder schedule is active.
ja: 保存済みのプライベートリマインダーのスケジュールは有効です。

source: Your saved replacement reason: %@
ja: 保存済みの置き換え理由：%@

source: Your saved review is ready to continue from Today.
ja: 保存済みの復習は「今日」から続けられます。

source: Your saved review preferences are unavailable. Regular reminders remain active, and your original saved data is unchanged.
ja: 保存済みの復習設定を利用できません。通常のリマインダーは引き続き有効で、元の保存データは変更されていません。

source: Your self-check: matched
ja: 自己評価：一致

source: Your self-check: not yet
ja: 自己評価：まだ一致していない

source: Your self-check: partly matched
ja: 自己評価：一部一致

source: Your shortened session is complete; the remaining blocks stay available on Today.
ja: 短縮セッションは完了しました。残りのブロックは「今日」から引き続き利用できます。

source: Your shortened session is complete; the remaining chapters stay available in Forge.
ja: 短縮セッションが完了しました。残りのチャプターはForgeで引き続き利用できます。

source: Your shortened session is complete; the remaining chapters stay available in Today.
ja: 短縮したセッションが完了しました。残りのセクションは「今日」から続けられます。

source: Your skill map is taking shape.
ja: スキルマップが形になってきました。

source: Your skill map starts unassessed.
ja: スキルマップは「未評価」から始まります。

source: Your source is ready for study.
ja: ソースを学習に使用できるようになりました。

source: Your source was saved locally but needs reprocessing.
ja: ソースはローカルに保存されましたが、再処理が必要です。

source: Your sources, under your control.
ja: あなたの情報源をあなたの管理下に。

source: Your starting levels
ja: 開始時のスキルレベル

source: Your starting plan
ja: あなたのスタートプラン

source: Your study activity was saved. Skipped and solution-viewed questions do not change skill scores.
ja: 学習の記録を保存しました。スキップした問題や解答を確認した問題は、スキルの評価を変えません。

source: Your submitted answers are saved. The remaining questions were not scored.
ja: 提出した回答は保存されています。残りの問題は採点されていません。

source: Your submitted answers are saved. There isn’t enough estimated time to start another question.
ja: 提出した回答は保存されています。次の問題に取り組むための目安時間が残っていません。

source: Your unsaved note, date range, and export choice will be lost.
ja: 未保存のメモ、日付範囲、書き出し設定は失われます。

source: Your unsaved profile and training preference changes will be lost.
ja: 未保存のプロフィールとトレーニング設定の変更が失われます。

source: Your unsaved question-set configuration or generated result will be lost. Saved sets and completed attempts remain in history.
ja: 未保存の問題セット設定または生成結果が失われます。保存済みのセットと完了した回答は履歴に残ります。

source: Your value after step %lld
ja: 手順%lldの後の自分の値

source: Your value after step %lld: %@
ja: 手順%lldの後の自分の値：%@

source: Your work is saved on this device. Its session summary could not be updated; you can retry the save.
ja: 入力内容はこの端末に保存されています。セッションの概要を更新できませんでした。保存を再試行できます。

source: You’ll rate your confidence before seeing feedback.
ja: フィードバックを見る前に、自分の確信度を評価します。

source: Zero is a meaningful value, so using it as an error sentinel merges two different states and hides data-quality failures.
ja: ゼロは意味のある値なので、エラーセンテナリストとして使用すると、2つの異なる状態がマージされ、データ品質の障害が隠されます。

source: [11.7, 12.3] mm; width 0.6 mm.
ja: [11.7、12.3] mm;幅0.6mm。

source: a = 0 and b = 2
ja: a = 0 かつ b = 2

source: a = 2 and b = 3
ja: a = 2 かつ b = 3

source: a = 2 and b = 4
ja: a = 2 かつ b = 4

source: a = 3 and b = 5
ja: a = 3 かつ b = 5

source: a familiar worked example
ja: 良く知られた実際の例

source: a hidden intermediate-state violation
ja: 隠れた中間状態違反

source: a map-reading workshop
ja: 地図を読むワークショップ

source: a puzzle-solving workshop
ja: パズルを解くワークショップ

source: a vocabulary practice workshop
ja: 語彙を練習するワークショップ

source: about %lld m
ja: 約 %1$lld メートル

source: accumulated change
ja: 蓄積された変化

source: activated cells
ja: 活性化細胞

source: active
ja: アクティブな

source: active day
ja: 活動的な日

source: active days
ja: アクティブ日数

source: add
ja: 足す

source: after %lld
ja: %lld回後

source: all domains
ja: すべてのドメイン

source: all inputs
ja: すべての入力

source: all modules
ja: すべてのモジュール

source: allow a later relaxation to lower a discovered but not-yet-finalized tentative distance
ja: 発見済みだが未確定の暫定距離を、後の緩和で小さくできること

source: always
ja: 常に

source: an undetected algebraic or implementation error
ja: 検出されない代数エラーまたは実装エラー

source: an untouched test set for honest generalization measurement
ja: 汎化性能を正直に測るための未使用のテストセット

source: another feature
ja: その他の特徴

source: answer format
ja: 回答形式

source: append and removeFirst mutate shared array storage, and the consumer can also run before an item exists. Both memory safety and protocol state need synchronization.
ja: 追加と削除最初の変異共有配列ストレージ、およびコンシューマーはアイテムが存在する前に実行することもできます。 メモリセーフティとプロトコル状態の両方が同期する必要があります。

source: applied stress
ja: 応力

source: apply a horizontal scale factor of 2 while leaving the vertical coordinate unchanged
ja: 垂直座標をそのままにして、水平尺度の係数を2に適用します

source: apply a sign convention, compute an energy change, and identify an invalid inference from exothermicity to spontaneity
ja: 符号規約を適用してエネルギー変化を計算し、発熱性から自発性を導く誤った推論を特定する

source: apply sign conventions and conservation constraints, solve a circuit or field relation, and diagnose an inconsistent unit or boundary condition
ja: 符号規約と保存則を適用して回路または場の関係を解き、単位や境界条件の矛盾を診断する

source: apply the first law with a declared sign convention, distinguish state functions from path quantities, and test the scale of the result
ja: 符号規約を明示して熱力学第一法則を適用し、状態関数と経路量を区別し、結果の大きさを検算する

source: assay interval
ja: 測定間隔

source: assay wells
ja: アッセイウェル

source: available today
ja: 今日利用可能

source: base-rate-hidden failure
ja: 基本レート隠し障害

source: baseline imbalance
ja: ベースラインアンバランス

source: baseline selection confounding
ja: ベースライン選択の混同

source: batch
ja: バッチ

source: before calculating product.
ja: 生成物を計算する前に比較してください。

source: biological responses
ja: 生物学的反応

source: bootstrap samples
ja: ブートストラップサンプル

source: boundary or local-optimum failure
ja: 境界条件または局所最適解による失敗

source: boundary test
ja: 境界テスト

source: bounded interpretation
ja: 境界解釈

source: c=2; x² is continuous on [1,3] and differentiable on (1,3).
ja: c=2; x²は[1,3]で連続的であり、（1,3）で微分可能である。

source: calculate a sampling constraint, diagnose aliasing or filter misuse, and interpret how a transformation changes signal and noise
ja: サンプリング条件を計算し、エイリアシングやフィルタの誤用を診断し、変換による信号と雑音の変化を解釈する

source: calculate an inheritance probability, state the assumptions behind it, and choose evidence that distinguishes independent assortment from linkage
ja: 遺伝確率を計算し、その仮定を述べ、独立の法則と連鎖を区別する証拠を選ぶ

source: captured samples
ja: サンプルを採取

source: cards
ja: 枚

source: cases
ja: ケース

source: causal graph
ja: 因果グラフ

source: cell culture
ja: 細胞培養

source: cells
ja: 細胞

source: chemical amount
ja: 化学量

source: choose a proof method, make every quantifier and induction step explicit, and find the first unsupported inference
ja: 証明法を選び、すべての量化記号と帰納段階を明示し、最初の正当化されていない推論を見つける

source: choose the conserved quantity, calculate a dilution or mixture concentration, and catch an inverted volume ratio
ja: 保存量を選び、希釈または混合後の濃度を計算し、体積比を逆にした誤りを見抜く

source: circle
ja: 円

source: code or spreadsheet
ja: コードまたは表計算

source: compare operation costs, trace a structural update, and justify a data-structure choice under explicit workload constraints
ja: 操作コストを比較し、構造更新を追跡し、明示されたワークロード制約の下でデータ構造の選択を正当化する

source: completed cycles
ja: 完了したサイクル

source: component
ja: コンポーネント

source: component length
ja: コンポーネントの長さ

source: components
ja: コンポーネント

source: compute precision, recall, and a base-rate-sensitive interpretation; then reason about how a threshold changes false positives and false negatives
ja: 適合率と再現率を計算してベースレートを踏まえて解釈し、しきい値が偽陽性と偽陰性をどう変えるか考える

source: confounded ablation evidence
ja: 混乱した焼斑除去の証拠

source: confounded component attribution
ja: 混乱したコンポーネントの属性

source: confounding by simultaneous physical changes
ja: 同時物理変化による混乱

source: construct a failing interleaving, identify the missing synchronization or idempotency condition, and explain which guarantee the repair provides
ja: 失敗するインターリービングを構成し、欠けている同期または冪等性条件を特定し、修正によって得られる保証を説明する

source: construct a free-body model, solve an equilibrium relation, calculate a safety factor, and identify one assumption that controls the result
ja: 自由物体モデルを作り、つり合い式を解き、安全率を計算し、結果を左右する仮定を一つ特定する

source: consumer { item = queue.removeFirst() }
ja: 消費者 { アイテム = queue.removeFirst() }

source: context
ja: 文脈

source: continue skips the only increment. A negative element therefore preserves the loop state and violates progress toward termination.
ja: 続けると、唯一の増分がスキップされます。したがって、負の要素はループ状態を保持し、終了への進捗を侵害します。

source: convert units exactly, combine simple tolerances, estimate the expected range, and reject a dimensionally inconsistent result
ja: 単位を正確に換算し、単純な公差を組み合わせ、予想範囲を見積もり、次元的に矛盾する結果を棄却する

source: correct positive predictions
ja: 正解の予測

source: coulombs
ja: クーロンブ

source: count must remain nonnegative
ja: カウントは負でないままでなければなりません

source: counted cases
ja: 症例数

source: counted operations
ja: カウントされた操作

source: cross
ja: クロス

source: cube
ja: 立方体

source: cycles
ja: サイクル

source: daily = events.groupBy(localCalendarDay)
ja: daily = イベント。groupBy（localCalendarDay）

source: daily = events.groupBy(localCalendarDay) // deployment compares UTC days
ja: daily = events.groupBy(localCalendarDay) // デプロイ時はUTC日付で比較する

source: data batches
ja: データバッチ

source: data processing
ja: データ処理

source: data split
ja: データ分割

source: day
ja: 日

source: decompose an estimate, state assumptions, and detect an answer that is implausible by orders of magnitude
ja: 推定量を要因に分解し、仮定を明示し、桁違いで不合理な答えを見抜く

source: delay
ja: 遅延

source: deltaG = deltaH + temperature * deltaS
ja: デルタG = デルタH + 温度 * デルタS

source: deltaG_kJ = deltaH_kJ - temperatureK * deltaS_J_per_K
ja: deltaG_kJ = deltaH_kJ - 温度K * deltaS_J_per_K

source: deltaH_kJ = -40
ja: デルタH_kJ = -40

source: deltaS_J_per_K = -100
ja: デルタS_J_per_K = -100

source: derive a result from a definition or theorem, check its assumptions, and interpret the result rather than only applying a formula
ja: 定義または定理から結果を導き、前提を確認し、公式を当てはめるだけでなく結果の意味を解釈する

source: derive the derivative of $$f(x)=x^2$$. Show the cancellation that makes the limit finite.
ja: $$f(x)=x^2$$の導関数を求め、極限を有限にする約分を示してください。

source: det(A)=0 and x=(−2,1) lies in null(A).
ja: det(A)=0で、x=(−2,1)はヌル(A)にあります。

source: det(A)=1·4−2·2=0. Also A(−2,1)ᵀ=(0,0)ᵀ, so A has a nontrivial null vector and is singular.
ja: det(A)=1·4−2·2=0。また、A(−2,1)ᵀ=(0,0)ᵀなので、Aには非正規零ベクトルがあり、奇数です。

source: det(A)=1·4−2·3=−2. One row swap reverses the determinant’s sign, so the swapped matrix has determinant 2, not −2.
ja: det(A)=1·4−2·3=−2。一列の交換は行列式の符号を反転させるため、交換された行列には符号2ではなく−2があります。

source: detect leakage in preprocessing or feature construction, choose an appropriate split, and explain what the test result does and does not generalize to
ja: 前処理または特徴量作成のリークを検出し、適切な分割法を選び、テスト結果が一般化できる範囲とできない範囲を説明する

source: detector
ja: 検出器

source: diagnostic
ja: 診断

source: diagram anchor
ja: 図のアクター

source: directly proportional
ja: 正比例

source: displacement
ja: 変位

source: distinguish association, prediction, and causation; identify the design change that would strengthen the claim
ja: 関連、予測、因果関係を区別し、主張を強めるために必要な研究デザインの変更を特定する

source: down
ja: 低下

source: e.g. limiting reagents, induction proofs, or graph traversal
ja: 例：限界反応物、数学的帰納法による証明、グラフ探索

source: ellipse only
ja: 楕円のみ

source: embedding point
ja: 埋め込みポイント

source: energy transfer
ja: エネルギーの移転

source: engineering units
ja: 工学ユニット

source: enthalpy change
ja: エンタルピー変化

source: entity or temporal dependence across splits
ja: 分割全体のエンティティまたは時間的依存関係

source: environment or dependency drift
ja: 環境または依存関係のドリフト

source: equilibrium concentration
ja: 平衡濃度

source: error units
ja: エラー単位

source: estimated events
ja: 推定イベント

source: evaluated records
ja: 評価された記録

source: evaluation fold
ja: 評価の折りたたみ

source: events
ja: イベント

source: every day
ja: 毎日

source: experimental batch
ja: 実験バッチ

source: extract a numerical comparison, preserve units and uncertainty, and state one conclusion the display cannot establish
ja: 数値的な比較を読み取り、単位と不確かさを保ち、その表示だけでは裏付けられない結論を一つ述べる

source: factor of safety %@
ja: 安全率%@

source: favorable outcomes
ja: 有利な結果

source: feasible output
ja: 実現可能な出力を

source: features = oneHotEncode(allData.category)
ja: 機能 = oneHotEncode(allData.category)

source: features.include(outcomeRecordedAt + 1day)
ja: 機能。包括（記録された結果 + 1日）

source: field
ja: 分野

source: fill every Fibonacci state from previously solved dependencies
ja: フィボナッチの各状態を、すでに解いた依存状態から埋めること

source: finalize a vertex only when its popped key equals its current tentative distance
ja: 取り出したキーが現在の暫定距離に等しい場合だけ頂点を確定すること

source: finite confirmation cannot prove a universal statement
ja: 有限個の確認では普遍命題を証明できない

source: flex day
ja: フレックスデー

source: for config in 1...200 { score = evaluate(config,test); keepBest(score) }
ja: 1...200 {スコア=evaluate(config,test)}の構成用

source: for every integer n ≥ 1. State the base case, induction hypothesis, and algebraic step for k + 1.
ja: がすべての整数n ≥ 1で成り立つことを示してください。基底の場合、帰納法の仮定、k + 1に対する代数的な手順を述べてください。

source: for i in 0..<n { for j in 0..<n { work(i,j) } }
ja: i in 0..<n { for j in 0..<n { work(i,j) } } }

source: for i in 0..<n { for j in 0..<n { work(i,j) } } // Claim: O(n)
ja: for i in 0..<n { for j in 0..<n { work(i,j) } } // 計算量の主張：O(n)

source: for i in values.indices { if values[i] < 0 { values.remove(at: i) } }
ja: 値のiに対する。indices { if values[i] < 0 { values.remove(at: i) } } }

source: formulate a model from stated assumptions, solve or simplify it, then test units, boundary cases, and sensitivity to one assumption
ja: 明示された仮定からモデルを定式化して解くか簡約し、単位、境界ケース、一つの仮定に対する感度を検証する

source: from $$v=v_0+at$$ and $$\Delta x=\frac{v+v_0}{2}t$$ by eliminating time.
ja: $$v=v_0+at$$と$$\Delta x=\frac{v+v_0}{2}t$$から時間を消去して導いてください。

source: func clamp(_ x:Int, low:Int, high:Int)->Int { min(low, max(high, x)) }
ja: 関数クランプ(_ x:Int, low:Int, high:Int)->Int { min(low, max(high, x)) }

source: func contains(_ values:[Int], _ target:Int)->Bool { for v in values { if v==target{return true} }; return false }
ja: func contains(_ values:[Int],_ target:Int)->Bool { vがvalues { if v==target{return true} }; return false }

source: func contains(_ values:[Int], _ target:Int)->Bool { for v in values { if v==target{return true} }; return false } // Benchmark only places target first.
ja: func contains(_ values:[Int], _ target:Int)->Bool { for v in values { if v==target{return true} }; return false } // ベンチマークでは対象値を先頭にしか配置していない。

source: func f(_ n:Int)->Int { if n<=1{return 1}; return f(n-1)+f(n-1) }
ja: 関数 f(_ n:Int)->Int { if n<=1{return 1}; return f(n-1)+f(n-1) }

source: func f(_ n:Int)->Int { if n<=1{return 1}; return f(n-1)+f(n-1) } // Claim: O(n)
ja: func f(_ n:Int)->Int { if n<=1{return 1}; return f(n-1)+f(n-1) } // 計算量の主張：O(n)

source: func first(_ values:[Int])->Int { values[0] }
ja: 関数1(_値:[Int])->Int {値[0] }

source: func sum(_ values: [Int]) -> Int { var total = 0; for v in values { total += v }; return total }
ja: 関数和(_値: [Int]) -> Int { var total = 0; for v in values { total += v }; return total }

source: func sum(_ values: [Int]) -> Int { var total = 0; for v in values { total += v }; return total } // Claim: O(1)
ja: func sum(_ values: [Int]) -> Int { var total = 0; for v in values { total += v }; return total } // 計算量の主張：O(1)

source: func visit(_ u: Vertex) {
ja: func訪問(_ u: Vertex) {

source: func visit(_ u: Vertex) { for v in neighbors[u] { visit(v) } visited.insert(u) } // directed edges: a→b, b→c, c→a
ja: func visit(_ u: Vertex) { for v in neighbors[u] { visit(v) } visited.insert(u) } // 有向辺：a→b、b→c、c→a

source: geneOn = activatorPresent && repressorPresent
ja: 遺伝子オン=活性化子存在 && 抑制子存在

source: governing invariant
ja: 管理不変

source: greater net force produces proportionally greater acceleration
ja: 正味の力が大きくなると、それに比例して加速度も大きくなります

source: grid state
ja: グリッド状態

source: group
ja: グループ

source: handling or vehicle effects
ja: 取り扱いや車両の影響

source: height
ja: 身長

source: held-out records
ja: ホールドアウトしたレコード

source: hexagon
ja: 六角形

source: hold before and after each iteration
ja: 各反復の前後に保持します

source: iCloud account changed. You are viewing the previous local history with sync off. Export it or start a separate fresh history.
ja: iCloudアカウントが変更されました。同期をオフにした状態で、以前のローカル履歴を表示しています。履歴をエクスポートするか、別の新しい履歴を開始してください。

source: iCloud is temporarily unavailable; local changes remain queued safely.
ja: iCloudは一時的に利用できません。ローカルの変更は安全にキューに入れられたままになります。

source: iCloud setup paused because the private store identity could not be verified.
ja: プライベートストアのIDを確認できなかったため、iCloudの設定を一時停止しました。

source: iCloud setup paused. Your existing local study history is unchanged.
ja: iCloudの設定を一時停止しました。既存のローカル学習履歴は変更されていません。

source: iCloud sync
ja: iCloud同期

source: iCloud sync is not available in this build or on this device.
ja: このビルドまたはデバイスでは、iCloud同期を利用できません。

source: iCloud sync setting not saved
ja: iCloud同期設定を保存できませんでした

source: iCloud sync will start after reopening
ja: 再度開くとiCloud同期が始まります

source: iCloud sync will stop after reopening
ja: 再度開くとiCloud同期が停止します

source: iOS decides when to grant optional maintenance time.
ja: 任意のメンテナンスに実行時間を割り当てるタイミングはiOSが決定します。

source: iOS did not register every optional task; foreground recovery remains complete.
ja: iOSですべての任意タスクを登録できませんでしたが、フォアグラウンドで完全に補完できます。

source: identify positive, negative, and procedural controls; block or randomize a nuisance variable; and match the conclusion to the design
ja: 陽性対照、陰性対照、手順対照を特定し、攪乱変数をブロック化または無作為化し、結論を研究デザインに適合させる

source: identify the invariant structure, map each quantity or condition, and verify that the transferred solution still satisfies its assumptions
ja: 不変な構造を特定し、各量や条件を対応づけ、移した解法が元の仮定を満たすか検証する

source: identify the limiting reagent from coefficient-adjusted amounts, compute theoretical yield, and diagnose a mole-ratio error
ja: 化学量論係数で補正した量から限定反応物を特定し、理論収量を計算し、モル比の誤りを診断する

source: identify the relevant sample space, compute a conditional probability, and explain how the base rate changes the conclusion
ja: 適切な標本空間を特定し、条件付き確率を計算し、ベースレートが結論をどう変えるか説明する

source: identify what a transformation changes and preserves, predict the resulting orientation or view, and verify the answer against coordinates or adjacency constraints
ja: 変換で変わるものと保たれるものを特定し、結果の向きや見え方を予測し、座標や隣接条件で答えを検証する

source: if !processed.contains(id) { chargeCard(idempotencyKey: id); processed.insert(id) } // duplicate delivery and crash/retry are possible
ja: if !processed.contains(id) { chargeCard(idempotencyKey: id); processed.insert(id) } // 重複配信およびクラッシュ後の再試行が起こり得る

source: if deltaH < 0 { spontaneous = true }
ja: デルタH < 0 {自発的=真}の場合

source: if signalHigh { inhibitor = 0 }
ja: 信号が高い場合{抑制剤=0}

source: implausible
ja: 妥当ではない

source: in-sample agreement without discrimination
ja: 差別のないサンプル契約

source: input changes
ja: 入力が変化する

source: input element
ja: 入力要素

source: input precedes state; state precedes output
ja: 入力は状態に先行します。状態が出力に先行する

source: input unit
ja: 入力ユニット

source: input-order, warmup, and timing noise
ja: 入力順序、ウォームアップ、タイミングノイズ

source: integer
ja: 整数

source: interacting variables
ja: 相互作用する変数

source: interpret a coefficient with units and conditioning, diagnose a residual pattern, and state why an observational coefficient need not be causal
ja: 単位と条件を含めて係数を解釈し、残差パターンを診断し、観察データの係数が因果効果とは限らない理由を述べる

source: interpret an interval without reversing its probability statement, distinguish effect size from significance, and identify a violated assumption
ja: 確率の意味を取り違えずに区間を解釈し、効果量と有意性を区別し、破られている仮定を特定する

source: inversely proportional
ja: 反比例

source: is x = 0, and identify the resulting statement about the null space of A.
ja: の解がx = 0のみであることを示し、Aの零空間について得られる結論を述べてください。

source: join users on email
ja: メールでユーザーに参加する

source: join users on email // email is not unique
ja: join users on email // メールアドレスは一意ではない

source: joules
ja: ジュール

source: kilogram
ja: キログラム

source: kilojoules
ja: キロジュール

source: kilonewtons
ja: キロニュトン

source: lamp hours
ja: ランプ時間

source: lamp-hours
ja: ランプ時間

source: length
ja: 長さ

source: let count = values.count
ja: 数えよう=値。数

source: let mid = (low + high) / 2
ja: let mid = (低 + 高) / 2

source: let score = scores[id]!
ja: スコアを計算しよう = scores[id]!

# lines %lld–%lld
source: lines %1$lld–%2$lld
ja: 行%1$lld – %2$lld

source: litre
ja: リットル

source: litres
ja: リットル

source: load step
ja: ロードステップ

source: lockA.lock(); lockB.lock(); work(); lockB.unlock(); lockA.unlock() // another task locks B then A
ja: lockA.lock(); lockB.lock(); work(); lockB.unlock(); lockA.unlock() // 別のタスクはB、Aの順にロックする

source: log₁₀(10)=1, so pH=4.76+1=5.76. It lies in the prompt’s conventional dilute-solution check range; that classroom range is not a universal physical bound for every concentrated aqueous solution.
ja: log₁₀(10)=1なので、pH=4.76+1=5.76。それはプロンプトの従来の希薄溶液チェック範囲にあります。その教室範囲は、すべての濃縮水溶液の普遍的な物理拘束ではありません。

source: lowers activation energy
ja: 活性化エネルギーを下げる

source: macOS performs the same maintenance when NeuroForge is active.
ja: NeuroForgeの実行中は、macOSが同じメンテナンスを行います。

source: managed notifications
ja: 管理対象の通知
